[
{
"name": "Puerto Rico Alliance For Companion Animals Inc",
"add1": "130 Winston Churchill Pmb 208 Ste 1 Suite 1, PMB 208",
"add2": "San Juan, PR, 00926",
"mission": "Our mission is to be the community’s premier knowledge resource in providing the highest quality and accessible humane education possible; and to become a recognized leader in providing programs andservices, which enhance the bond between animals and humans.",
"program": "Through our Outreach Program, we want to offer support and guidelines to those individuals, groups or communities who express interest in becoming an active part to the solution of dog and cat overpopulation and/or to minimize the abandonment, neglect and abuse of animals in Puerto Rico.  We will work directly with individuals, groups and community to develop a strategic plan and working model to assist and support them in organizing and implementing a humane education program. \r\n\r\n \r\n1. The responsibilities to a companion animal\r\n2. Importance of spay and neuter.\r\n3. The laws and rights of animals \r\n4. How to report abuse and violence against animals\r\n5. Adoption\r\n6. Compassion and respect towards all living creatures \r\n7. Training and education about animals \r\n8. The shelters and rescue groups that exist in Puerto Rico."
},
{
"name": "West Valley Humane Society",
"add1": "5801 Graye Lane ",
"add2": "Caldwell, ID, 83607",
"mission": "To provide professional and compassionate animal services through shelter, adoption, educational programs, population control and health care service, while remaining fiscally responsible.",
"program": "Thanks to donated food, Canyon County Animal Shelter can lend a helping hand to pet owners in need of food for dogs and cats.  A specific quantity for each pet is available once a month provided there is enough inventory."
},
{
"name": "White County Humane Society",
"add1": "P.O. Box 194 ",
"add2": "Sparta, TN, 38583",
"mission": "To eliminate the pain and suffering of animals in White County through an aggressive spay/neuter assistance program.",
"program": "Several years ago our organization purchased a good quality dog costume, with the intention of having a Humane Society Mascot.  Our local newspaper sponsored a \"name the mascot\" contest, and \"Hero\" was the winning entry.  Since then, Hero has made numerous appearances at community events, schools, nursing homes, etc, promoting the Humane Society and our programs.  Although the initial expenditure was high, we feel that Hero has paid for himself many times over, with the goodwill he promotes toward our organization.  Occasionally we have to spend a little money to get Hero's costume cleaned, and purchase supplies to keep him \"cool\" during the hot summer appearances."
},
{
"name": "Fluffybutts Rescue Resort Incorporated",
"add1": "7713 Wesley Road ",
"add2": "Machesney Park, IL, 61115",
"mission": "We help the sick, healthy, young, old, discarded, abused and neglected dogs by rescuing them, getting them medical care and then finding them homes.",
"program": "We have an annual fundraiser in the summer.  We have ongoing fundraising projects such as selling merchandise and having auctions.  We rely heavily on donations from other dog lovers."
}
]
